---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.MEPCurveType
source: html/1c91d6c1-e355-dfd0-8267-de3da60c9941.htm
---
# MEPCurveType Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.